feat: implementa ciclo de vida da notificação
